app/controllers/categories_controller.rb

  def index
    @categories = Category.paginate(:page => params[:page], per_page: 10)
---
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sa"], ["created_at", "2017-06-20 13:33:40.835757"], ["updated_at", "2017-06-20 13:33:40.835757"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Teste 2 (editado)"], ["updated_at", "2017-06-20 14:23:00.566682"], ["id", 6]]