app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
SELECT COUNT(*) FROM "invoices"
---
  def index
    @invoices = Invoice.paginate(:page => params[:page], per_page: 10)

INSERT INTO "invoices" ("category_id", "role", "name", "amount", "due_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["category_id", 5], ["role", 1], ["name", "sdf"], ["amount", "10.0"], ["due_date", "2017-06-20"], ["created_at", "2017-06-21 01:39:30.799858"], ["updated_at", "2017-06-21 01:39:30.799858"]]
---
  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save

UPDATE "invoices" SET "due_date" = $1, "paid" = $2, "updated_at" = $3 WHERE "invoices"."id" = $4  [["due_date", "2017-06-21"], ["paid", "f"], ["updated_at", "2017-06-21 16:07:41.709975"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @invoice.update(invoice_params)

DELETE FROM "invoices" WHERE "invoices"."id" = $1  [["id", 2]]
---
  def destroy
    @invoice.destroy

SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_invoice
      @invoice = Invoice.find(params[:id])